python_collections.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-25 Wed 22:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Модуль collections в Python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="python" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Модуль collections в Python</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga47a663">1. Некоторые интересные классы из модуля <b>collections</b></a></li>
<li><a href="#org97af60f">2. Counter</a>
<ul>
<li><a href="#orgf60ae94">2.1. метод elements</a></li>
<li><a href="#orgd9151a0">2.2. метод most_common</a></li>
<li><a href="#org67deb16">2.3. Сложение и вычитание</a></li>
</ul>
</li>
<li><a href="#org117f965">3. Deque</a></li>
<li><a href="#org36e398e">4. namedtuple</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga47a663" class="outline-2">
<h2 id="orga47a663"><span class="section-number-2">1</span> Некоторые интересные классы из модуля <b>collections</b></h2>
<div class="outline-text-2" id="text-1">
<p>
Для начала, нам необходимо импортировать модуль
</p>
<div class="org-src-container">
<pre class="src src-python" id="org5f99fba"><span style="color: #00ff00; font-weight: bold;">import</span> collections
</pre>
</div>
</div>
</div>

<div id="outline-container-org97af60f" class="outline-2">
<h2 id="org97af60f"><span class="section-number-2">2</span> Counter</h2>
<div class="outline-text-2" id="text-2">
<p>
Это подкласс класса <b>dict</b>.
</p>
</div>

<div id="outline-container-orgf60ae94" class="outline-3">
<h3 id="orgf60ae94"><span class="section-number-3">2.1</span> метод elements</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Возвращает <i>итератор</i> над элементами counter-а, где каждый ключ будет повторён столько раз, каково значение этого ключа.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> collections

<span style="color: #ffffff;">c</span> = collections.Counter(a=4, b=2, c=0, d=-2)
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #b0c4de; font-weight: bold;">list</span>(c.elements()))
</pre>
</div>

<pre class="example">
['a', 'a', 'a', 'a', 'b', 'b']

</pre>
</div>
</div>

<div id="outline-container-orgd9151a0" class="outline-3">
<h3 id="orgd9151a0"><span class="section-number-3">2.2</span> метод most_common</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Возвращает лист пар в порядке убывания значений.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> collections
<span style="color: #00ff00; font-weight: bold;">print</span>(collections.Counter(<span style="color: #ffa500;">'abracadabra'</span>).most_common(3))
</pre>
</div>

<pre class="example">
[('a', 5), ('r', 2), ('b', 2)]

</pre>
</div>
</div>

<div id="outline-container-org67deb16" class="outline-3">
<h3 id="org67deb16"><span class="section-number-3">2.3</span> Сложение и вычитание</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> collections

<span style="color: #ffffff;">a</span> = collections.Counter(a=4, b=2, c=0, d=-2)
<span style="color: #ffffff;">b</span> = collections.Counter(a=1, b=2, c=3, d=4)

<span style="color: #00ff00; font-weight: bold;">print</span>(a + b)
<span style="color: #00ff00; font-weight: bold;">print</span>(a - b)
<span style="color: #00ff00; font-weight: bold;">print</span>(a &amp; b)
<span style="color: #00ff00; font-weight: bold;">print</span>(a | b)
a.subtract(b)
<span style="color: #00ff00; font-weight: bold;">print</span>(a)
</pre>
</div>

<pre class="example">
Counter({'a': 5, 'b': 4, 'c': 3, 'd': 2})
Counter({'a': 3})
Counter({'b': 2, 'a': 1})
Counter({'a': 4, 'd': 4, 'c': 3, 'b': 2})
Counter({'a': 3, 'b': 0, 'c': -3, 'd': -6})

</pre>
</div>
</div>
</div>

<div id="outline-container-org117f965" class="outline-2">
<h2 id="org117f965"><span class="section-number-2">3</span> Deque</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> collections

<span style="color: #ffffff;">d</span> = collections.deque([1, 2, 3, 4, 5])
d.append(6)
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
d.appendleft(0)
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
<span style="color: #00ff00; font-weight: bold;">print</span>(d.count(2))
d.clear()
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
d.extend([<span style="color: #ffa500;">'a'</span>, <span style="color: #ffa500;">'b'</span>, <span style="color: #ffa500;">'c'</span>])
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
d.extendleft([<span style="color: #ffa500;">'x'</span>, <span style="color: #ffa500;">'y'</span>, <span style="color: #ffa500;">'z'</span>])
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
<span style="color: #00ff00; font-weight: bold;">print</span>(d.pop())
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
<span style="color: #00ff00; font-weight: bold;">print</span>(d.popleft())
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
d.remove(<span style="color: #ffa500;">'x'</span>)
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
d.reverse()
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
d.rotate(2)
<span style="color: #00ff00; font-weight: bold;">print</span>(d)
</pre>
</div>

<pre class="example">
deque([1, 2, 3, 4, 5, 6])
deque([0, 1, 2, 3, 4, 5, 6])
1
deque([])
deque(['a', 'b', 'c'])
deque(['z', 'y', 'x', 'a', 'b', 'c'])
c
deque(['z', 'y', 'x', 'a', 'b'])
z
deque(['y', 'x', 'a', 'b'])
deque(['y', 'a', 'b'])
deque(['b', 'a', 'y'])
deque(['a', 'y', 'b'])
</pre>
</div>
</div>

<div id="outline-container-org36e398e" class="outline-2">
<h2 id="org36e398e"><span class="section-number-2">4</span> namedtuple</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Immutable!</b>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> collections

<span style="color: #ffffff;">Point</span> = collections.namedtuple(<span style="color: #ffa500;">'Point'</span>, [<span style="color: #ffa500;">'x'</span>, <span style="color: #ffa500;">'y'</span>])
<span style="color: #ffffff;">p</span> = Point(x=1, y=2)
<span style="color: #00ff00; font-weight: bold;">print</span>(p)
<span style="color: #00ff00; font-weight: bold;">print</span>(p.x)
</pre>
</div>

<pre class="example">
Point(x=1, y=2)
1

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-25 Wed 22:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
